<?php

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class CitySeeder extends Seeder
{

    static $cities = [
        'Кишинев',
        'Бельцы',
        'Бендеры',
        'Бессарабка',
        'Бричаны',
        'Вадул-луй-Водэ',
        'Вулканешты',
        'Глодяны',
        'Дондюшаны',
        'Дрокия',
        'Дубоссары',
        'Единцы',
        'Кагул',
        'Калараш',
        'Кантемир',
        'Каушаны',
        'Комрат',
        'Крикова',
        'Криуляны',
        'Леова',
        'Леушены',
        'Ниспорены',
        'Новые Анены',
        'Окница',
        'Оргеев',
        'Резина',
        'Рыбница',
        'Рышканы',
        'Сороки',
        'Страшены',
        'Сынжерей',
        'Тараклия',
        'Теленешты',
        'Тирасполь',
        'Унгены',
        'Фалешты',
        'Флорешты',
        'Хынчешты',
        'Чадыр-Лунга',
        'Чимишлия',
        'Шолданешты',
        'Штефан Водэ',
        'Яловены',
    ];

    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        foreach (self::$cities as $city) {
            DB::table('cities')->insert(
                [
                    'name'       => $city,
                    'created_at' => date('Y-m-d H:i:s'),
                ]
            );
        }
    }
}
